tests/mixerVessel2D_test/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probesU_channel
	{
		type	probes;
		libs	("libsampling.so");
		enabled	true;
		writeControl	timeStep;
		writeInterval	1;

		fields
		(
		U
		);

		probeLocations
		(
(	0.07363108	0	0.04908739	)
(	0.07363108	0	0.24543693	)
(	0.07363108	0	0.44178647	)
(	0.07363108	0	0.63813601	)
(	0.07363108	0	0.83448555	)
(	0.07363108	0	1.03083509	)
(	0.07363108	0	1.22718463	)
(	0.07363108	0	1.42353417	)
(	0.07363108	0	1.61988371	)
(	0.07363108	0	1.81623325	)
(	0.07363108	0	2.01258279	)
(	0.07363108	0	2.20893233	)
(	0.07363108	0	2.40528188	)
(	0.07363108	0	2.60163142	)
(	0.07363108	0	2.79798096	)
(	0.07363108	0	2.9943305	)
(	0.36815539	0	0.04908739	)
(	0.36815539	0	0.24543693	)
(	0.36815539	0	0.44178647	)
(	0.36815539	0	0.63813601	)
(	0.36815539	0	0.83448555	)
(	0.36815539	0	1.03083509	)
(	0.36815539	0	1.22718463	)
(	0.36815539	0	1.42353417	)
(	0.36815539	0	1.61988371	)
(	0.36815539	0	1.81623325	)
(	0.36815539	0	2.01258279	)
(	0.36815539	0	2.20893233	)
(	0.36815539	0	2.40528188	)
(	0.36815539	0	2.60163142	)
(	0.36815539	0	2.79798096	)
(	0.36815539	0	2.9943305	)
(	0.6626797	0	0.04908739	)
(	0.6626797	0	0.24543693	)
(	0.6626797	0	0.44178647	)
(	0.6626797	0	0.63813601	)
(	0.6626797	0	0.83448555	)
(	0.6626797	0	1.03083509	)
(	0.6626797	0	1.22718463	)
(	0.6626797	0	1.42353417	)
(	0.6626797	0	1.61988371	)
(	0.6626797	0	1.81623325	)
(	0.6626797	0	2.01258279	)
(	0.6626797	0	2.20893233	)
(	0.6626797	0	2.40528188	)
(	0.6626797	0	2.60163142	)
(	0.6626797	0	2.79798096	)
(	0.6626797	0	2.9943305	)
(	0.95720401	0	0.04908739	)
(	0.95720401	0	0.24543693	)
(	0.95720401	0	0.44178647	)
(	0.95720401	0	0.63813601	)
(	0.95720401	0	0.83448555	)
(	0.95720401	0	1.03083509	)
(	0.95720401	0	1.22718463	)
(	0.95720401	0	1.42353417	)
(	0.95720401	0	1.61988371	)
(	0.95720401	0	1.81623325	)
(	0.95720401	0	2.01258279	)
(	0.95720401	0	2.20893233	)
(	0.95720401	0	2.40528188	)
(	0.95720401	0	2.60163142	)
(	0.95720401	0	2.79798096	)
(	0.95720401	0	2.9943305	)
(	1.25172832	0	0.04908739	)
(	1.25172832	0	0.24543693	)
(	1.25172832	0	0.44178647	)
(	1.25172832	0	0.63813601	)
(	1.25172832	0	0.83448555	)
(	1.25172832	0	1.03083509	)
(	1.25172832	0	1.22718463	)
(	1.25172832	0	1.42353417	)
(	1.25172832	0	1.61988371	)
(	1.25172832	0	1.81623325	)
(	1.25172832	0	2.01258279	)
(	1.25172832	0	2.20893233	)
(	1.25172832	0	2.40528188	)
(	1.25172832	0	2.60163142	)
(	1.25172832	0	2.79798096	)
(	1.25172832	0	2.9943305	)
(	1.54625263	0	0.04908739	)
(	1.54625263	0	0.24543693	)
(	1.54625263	0	0.44178647	)
(	1.54625263	0	0.63813601	)
(	1.54625263	0	0.83448555	)
(	1.54625263	0	1.03083509	)
(	1.54625263	0	1.22718463	)
(	1.54625263	0	1.42353417	)
(	1.54625263	0	1.61988371	)
(	1.54625263	0	1.81623325	)
(	1.54625263	0	2.01258279	)
(	1.54625263	0	2.20893233	)
(	1.54625263	0	2.40528188	)
(	1.54625263	0	2.60163142	)
(	1.54625263	0	2.79798096	)
(	1.54625263	0	2.9943305	)
(	1.84077695	0	0.04908739	)
(	1.84077695	0	0.24543693	)
(	1.84077695	0	0.44178647	)
...
		);
	}	
        
// ************************************************************************* //
